
export const ACADEMIC_STAGES = [
  {
    id: 'kindergarten',
    name: 'رياض الأطفال',
    subGrades: ['كي جي 1', 'كي جي 2']
  },
  {
    id: 'primary',
    name: 'المرحلة الابتدائية',
    subGrades: ['الصف الأول الابتدائي', 'الصف الثاني الابتدائي', 'الصف الثالث الابتدائي', 'الصف الرابع الابتدائي', 'الصف الخامس الابتدائي', 'الصف السادس الابتدائي']
  },
  {
    id: 'preparatory',
    name: 'المرحلة الإعدادية',
    subGrades: ['الصف الأول الإعدادي', 'الصف الثاني الإعدادي', 'الصف الثالث الإعدادي']
  },
  {
    id: 'secondary',
    name: 'المرحلة الثانوية',
    subGrades: ['الصف الأول الثانوي', 'الصف الثاني الثانوي', 'الصف الثالث الثانوي']
  }
];
